#!/bin/bash

#***************************************************************
#  数组操作
#  @author Jerry hsu
#***************************************************************
contains(){
  i=0;size="$#";last=${!#}
  for t in "$@"; do
     (( i = $i + 1 ))
     if [ $i -lt $size ];then
         if [ $t -eq $last ];then
              echo 1;
              return;
           fi
     fi
  done
  if [ $i -eq $size ];then
        echo 0;
    fi
}

#***************************************************************
#  数组长度获取
#  @params 数组
#***************************************************************
getLength(){
  echo "$#"
}

#***************************************************************
#  根据索引获取数组元素
#  @params 数组 索引
#****************************************************************
get(){
  last=${!#}
  local newArray=($(echo "$@"))
  len=$(getLength ${newArray[*]});
  if [ $last -gt $len ]
  then
    echo "None"
  fi
  for ((i=0;i<$len;i++))
  do
    if [ $i -eq $last ]
    then
        echo ${newArray[$i]};
      fi
  done
}

#**************************************************************
# 数组遍历，分割符默认空格
# @params 数组
#**************************************************************
tranfer(){
  echo "$@";
}

#**************************************************************
#  数组尾部添加元素
#  @params 原始数组和被添加元素
#**************************************************************
append(){
  tmp=$(tranfer "$@")
  echo ${tmp[*]}
}

#***************************************************************
# 使用冒泡排序实现数组排序
# @param 数组
#***************************************************************
sort_bubble(){
  local newArray=($(echo "$@"))
  size=$[ "$#" - 1 ];
  for(( i=0; i <= $size; i++ )){
    for(( j=$[ $i + 1 ]; j <= $size; j++ )){
      if [ ${newArray[$i]} -gt ${newArray[$j]} ];then
          t=${newArray[$i]};
          newArray[$i]=${newArray[$j]};
          newArray[$j]=$t;
        fi
    }
  }
  echo ${newArray[*]}
}

#************************************************************************
# 数组拷贝和容量限制
# @params 元素数组 容量
#************************************************************************
copyOf(){
   local newArray=($(echo "$@"))
   local res=()
   size=$[ "$#" - 1 ];
   last=${!#}
   for ((i=0;i<$last;i++))
   do
      res[$i]=${newArray[$i]};
   done
   echo ${res[@]}
}
