#!/bin/bash

#***********************************************************************
# 两个变量值交换,函数内部变量交换，含有返回值。使用函数副作用，无返回值            #
# @author Jerry hsu                                                    #
#***********************************************************************

#************************************************************************
# 函数副作用,全局变量取名必须为gp_0和gp_1，详细的调用，请查看<h2>swap</h2>函数调用
# @param gp_0 第一个全局变量
# @param gp_1 第二个全局变量
#************************************************************************
swap_by_effect(){
   gp_0=$[ gp_0 ^ gp_1 ]
   gp_1=$[ gp_0 ^ gp_1 ]
   gp_0=$[ gp_0 ^ gp_1 ]
}

#************************************************************************
# 函数副作用,全局变量取名必须为gp_0和gp_1，详细的调用，请查看<h2>swap</h2>函数调用
# @param gp_0 第一个变量（传参时变量名无要求）
# @param gp_1 第二个变量（传参时变量名无要求）
#************************************************************************
swap(){
  local gp_0=$1
  local gp_1=$2
  swap_by_effect
  echo $gp_0,$gp_1
}

main(){
  swap 1 2
  sleep 10s
}

main
